x1, y1 = map(float, input("Введите координаты первой вершины (x1 y1): ").split())
x2, y2 = map(float, input("Введите координаты второй вершины (x2 y2): ").split())
x3, y3 = map(float, input("Введите координаты третьей вершины (x3 y3): ").split())
a =((x2-x1)*2+(y2-y1)*2)**0.5
b = ((x3 - x2)*2 + (y3 - y2)*2) ** 0.5
c = ((x1 - x3) *2 + (y1 - y3)*2) ** 0.5
p = (a + b + c) / 2
s = (p * (p - a) * (p - b) * (p - c)) ** 0.5
perimeter = a + b + c
print(f"Периметр треугольника: {perimeter}")
print(f"Площадь треугольника: {s}")

